Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionOverconstrainedError Property
 The Dimension would overconstrain the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionOverconstrainedError { get; }
Public Shared ReadOnly Property DimensionOverconstrainedError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionOverconstrainedError {
	FailureDefinitionId^ get ();
}
static member DimensionOverconstrainedError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace